DataProcessors/АР17_ОтправкаНаПочту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР17_ОтправкаНаПочту</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/АР17_ОтправкаНаПочту/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ОтчетАгентаКАгентскомуДоговору.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ОтчетАгентаКАгентскомуДоговору КАК АР17_ОтчетАгентаКАгентскомуДоговору
	               |ГДЕ
	               |	АР17_ОтчетАгентаКАгентскомуДоговору.Дата МЕЖДУ &ДатаН И &ДатаК";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаК", ОкончаниеПериода);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДокументов.Загрузить(Выгрузка);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ТабДокументов.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	НастройкаПериода = Новый ДиалогРедактированияСтандартногоПериода();
	НастройкаПериода.Период = Новый СтандартныйПериод(НачалоПериода,ОкончаниеПериода);
	Если НастройкаПериода.Редактировать() Тогда
         НачалоПериода = НастройкаПериода.Период.ДатаНачала;
         ОкончаниеПериода = НастройкаПериода.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	ОбъектыПечати = Неопределено;
	Для Каждого Стр Из ТабДокументов	Цикл
		Если НЕ Стр.Пометка Тогда Продолжить; КонецЕсли;
		
		Email = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Стр.Ссылка.Контрагент,	Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
		Если Email = "" Тогда Продолжить; КонецЕсли;
		
		//файл
		ТабДок = Документы.АР17_ОтчетАгентаКАгентскомуДоговору.ПечатьОтчета(Стр.Ссылка, ОбъектыПечати, Ложь);
		Если Одобрения = "ТребуетОдобрения" Тогда
			ПутьСохраненияФайла = "\\server-str\obmen\SaaS\reports\"; 
		Иначе
			ПутьСохраненияФайла = "\\server-str\obmen\SaaS\presentations\";
		КонецЕсли;	
		
		ПутьСохраненияФайла = ПутьСохраненияФайла + Стр.Ссылка.Номер + ";type_1;" + Email + ".pdf "; //type_1;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
		ТабДок.Записать(ПутьСохраненияФайла,ТипФайлаТабличногоДокумента.PDF);
		//письмо
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP 	= "smtp.becar.ru";
		
		Сообщение 					= Новый ИнтернетПочтовоеСообщение;
		Сообщение.Получатели.Добавить(Email);
		//Сообщение.ИмяОтправителя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		Сообщение.Вложения.Добавить(ПутьСохраненияФайла);

		ИнтернетПочта = Новый ИнтернетПочта;
	    ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Сообщение);
		ИнтернетПочта.Отключиться();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Одобрения = "ТребуетОдобрения";
КонецПроцедуры
